#!/bin/bash
goodnight=(
"夜深了，睡觉吧，送你几声呼噜吧：一声好运气，二声有福气，三声喜气罩，四声运气到。收到祝福开始呼噜吧，哈哈，晚安！"
"写一首诗歌，带去我的思念；送一缕清风，给你温馨祝愿；致一声问候，让你酣然成眠；唱一首歌谣，请你莫要忧烦；道一句晚安，愿你夜夜平安。晚安。"
"深呼吸，所有烦恼抛弃，捶捶背，所有劳累忘记，泡泡脚，所有疲惫散去，数星星，所有浮躁褪尽，看信息，我的祝福来袭，愿你舒心顺意，开心顺利，烦心顺短信溜去！顺便道一声：晚安！"
"牵挂是月光的皎洁，照彻浓浓的黑夜，思念是夏夜沁凉的风，吹拂你的额际躁动，惦记是温煦的床第，承托你疲惫的身体，有我的陪伴夏夜里不再暗黑的沉闷，尽情地舒展，祝美梦，晚安。"
"黑夜给了我黑色的眼睛，我用它在黑暗世界里寻找你的身影。夜深了你也该睡觉啦，别在东张西望啦，也别再旺旺叫啦，更别在破坏我的好事啦，狗狗晚安。"
"太阳的余晖褪尽了，忙碌的一天结束了，绷紧的神经该放轻松了，想念那张软软的大床了，知道你就等我的精神安慰了，卸去身上的所有累赘了，现在可以安然入睡了，梦里甜甜的我让你依偎了……晚安！呵呵！"
"我愿把真心祝福化作一阵柔风，给你吹去一身的疲惫，我愿把真情问候化作一曲音符，给你除去一天的烦愁.在这宁静的夜晚，愿祝福和问候紧紧将你围绕，伴你甜美入梦.晚安！"
"知道吗，睡前你需要进行一次彻底的屠杀活动，把烦恼杀掉，把忧郁灭掉，把压力毁掉，把哀愁撕票，据说这样，整晚你会拥有一个好梦，朋友晚安。"
"安心入睡＝身体健康，身体健康＝精力充沛，精力充沛＝工作认真，工作认真＝业绩突出，业绩突出＝财富无限，看到没有，你一个安心入睡就能得到这么多，别等了，好好睡吧，愿你今夜好梦相拥。"
"白天工作，“已经了然”，夜晚到来，顺其自然，放下负担，轻松安然，进入梦乡，自由坦然，祝你晚安，快乐怡然，做个好梦，悠哉悠然。"
"用轻松化为定神汤舒缓压力，用清爽化为安神剂减轻烦劳，用宁静化为静神丸散尽疲意，用问候化为安眠水升起睡意，送给夜里失眠的你，愿你饮下，让酣睡甜甜随你，让美梦悠悠陪你！"
"爬上你的如意床，枕好你的无忧枕，盖上你的快乐被，开心陪在你身边，幸福围在你身旁，合上你的多情眼，美梦伴你一整晚。晚安，愿安然入睡。"
"把一身疲惫甩在家门外，晚饭间家人的谈笑让你轻松自然。看看新闻咨询让你遍知天下事，洗个澡泡个脚让你神清气爽，舒舒服服睡个觉让你美梦一晚。说一声晚安！道一句你辛苦了！"
"长夜绵绵，送给你俏丽的容颜，愿你在夏日的夜晚不再孤单；霓虹闪闪，送给你温暖的港湾，愿你一生有我的陪伴；祝福甜甜，送给你一句真诚的感言，愿你的生命更加斑斓。晚安！"
"城市的夜空没有繁星点点！可是却湮没不了我对你的思念之光！炎炎的夏夜没有禅鸣声声！可是却少不了我送去的祝福点点！点点思念伴你晚安，声声祝福望你好梦！"
"当夜幕降临，我开始祈祷：祝我心里的你平安！当月亮升起，我开始祝福：祝我牵挂的你今夜好梦！当一丝的微风吹过，我希望能送去我真心的祝福，使你疲惫的身心得到舒缓！今夜好梦！晚安！"
"发给你的是思念，你接收的是祝福，传递下去是快乐；体会到的是关怀，感觉到的是真心，分享的才叫生活；晚安！好梦！想你！"
"乖乖，你看那月牙已上树梢，你听那蝉虫也已熄声，天不早了，早点歇息，掖好被子不准乱踢，做个好梦，愿你明天一睁眼就有蜜糖般的心情，晚安baby。"
"节日快乐！那边的你在笑吗？月到中秋，分外想你。看到那团圆圆的月亮吗？那就是我想你念你牵系你的心！爱你吻你！晚安！"
"快乐的日子，幸福的你。美妙的生活，温情的你。快乐幸福的日子里，希望与你分享。美妙激情的生活的里，有你的温情快乐无比！晚安！好梦！"
"虽然城市里爱美的人都喜欢减肥，我的想念还是我行我素的增肥，虽然雨后的彩虹七种颜色很美，我还是希望白天换来黑夜后跟你问候一句，晚安。"
"在你梦的古堡里，有没有一只小熊在寻找你要的蜂蜜，在你梦的河流里，有没有一只蝴蝶在偏偏跳起你爱的舞曲，亲爱的，好人好梦，晚安。"
"季节交相替，友情长相忆。大雁南飞去，落叶风中戏。寒暑不可避，冷暖多留意。山水隔距离，问候遥相寄。匆匆虽难聚，心中倍珍惜：千万保重身体。晚安。"
"虽然城市里爱美的人都喜欢减肥，我还是我行我素的增肥，虽然雨后的彩虹七种颜色很美，我还是希望白天换来黑夜后跟你道一句：晚安"
"茶，把苦涩深藏，散发清香；风，为心情补氧，释放清凉；夜晚，把美好收藏，绽放梦想；睡眠，为疲惫疗伤，心情舒畅。晚安！"
"^o^刚刚我给夜空中的星星客服发了短消息：为你带去宁静，祥和，温暖，好梦！星星客服答应了，并且还要洒下星空下的余辉陪伴你安然入睡，让明月来装饰你的梦。流星划过时就已把问候落至你的手机窗口：夜深了，晚安！"
"关掉“烦恼灯”，脱掉“疲劳鞋”，甩掉“忧烦衣”，躺着“轻松枕”，盖着“舒服被”，牵着“周公梦”，甜甜美美去梦游。晚安！"
"朝起朝落的日子，总有一个笑，可以伴着黑夜进入梦乡，进入没有虚假的世界，晚安，世界！你好，明天！"
"^o^小时侯，幸福是一件东西，拥有就幸福；长大后，幸福是一个目标，达到就幸福；成熟后，发现幸福原来是一种心态，领悟就幸福。幸福的说一声：晚安"
"空白格，空的是心里剩余的温柔还是你，白色的是天空还是情人节被等待的时间，我落在琴键上的泪水，抱着对不起说晚安，亲爱的，原谅我不能再爱你。"
"有人说，失眠，是因为你正在别人的梦里辛苦地忙碌着。。。忙完了赶紧睡吧~晚安！"
"卸去一天的重负，轻轻闭上你的眼睛，让快乐悄悄进入你的梦乡，让幸福静静守在你的身旁，让我的祝福为你建造一个美好的梦境。晚安"
"早晨给你一个早安吻，对你说：早安；下午递你一杯温奶茶，对你说：午安；午夜拥你入怀抱，对你说：晚安。亲爱的，时刻都想你。"
"人生中，我们有太多的烦恼与浮躁，伴随着这个夏季的炎热而来。只有晚上，风是凉爽的，心是清闲的，因而我们应懂得享受。晚安"
"^o^刚刚我给夜空中的星星客服发了短消息：为你带去宁静，祥和，温暖，好梦！星星客服答应了，并且还要洒下星空下的余辉陪伴你安然入睡，让明月来装饰你的梦。流星划过时就已把问候落至你的手机窗口：夜深了，晚安！"
"深呼吸，甩掉所有脾气，淋场雨，放弃所有复杂，等彩虹，等待所有美丽，赞生命，如此伟大的信仰，睡一觉，和天亮，说句晚安。"
"想送你一个月亮，有我对你温和的嘱咐；想送你一颗星星，有我给你俏皮的祝福；想送你一条美梦，让晚安连同星星月亮随你入梦！"
"想你的时候最充实，念你的时候最逍遥，牵挂老是跟你跑，问候把你最先到，愿你日日乐陶陶，祝你夜夜梦美好。晚安！"
"岁月流逝，你我情意不变；时光荏苒，你我牵挂依然；四季轮回，思念常记心间；早安晚安，问候充满心田。春来暑往路漫漫，心手相牵别走散，有你陪伴我身边，友情绵长心圆满，祝你早安每一天，快乐珍藏在心间！"
"每天努力一点，每天进步一点，就能创造一个意想不到的奇迹。晚安！"
"不要杞人忧天，烦恼并不会减少明天的负担，却会失去今天的快乐~晚安~好梦"
"大多数时光里，我们不是在重复自己的生活，就是在重复别人的生活。真正的幸福，不是活成别人那样，而是按自己的意愿去生活。晚安"
"每天努力一点，每天进步一点，就能创造一个意想不到的奇迹。晚安！"
"好好睡觉，天天吃好。睡觉别起早，吃饭要吃饱。笑要说我好，做梦题别跑。早点睡觉就是好，说声晚安问声好，看！才子编的多好"
"^o^在这安静的深夜，我让思念慢慢开出花蕊，吐露爱恋的芬芳，陶醉怡人的月光，给你一路的温暖，在那幸福的梦乡，亲爱的，晚安，好梦。"
"遥遥的梦亮起一盏灯，听我心愿一声声，但愿你平安一程又一程，但愿所有的美好装满您的梦，祝您今晚安然入睡，好梦！"
"日出+日落=平平安安；月亮+星星=无限思念；风花+雪月=幸福一生；流星+心语=祝福万千，希望你做个好梦，晚安！"
"有钱，用不到下辈子；貌美，不能当饭吃；幸福，就是两个人过日子。最美的日子，无非是我在闹，你在笑，如此足矣。晚安，！"
"别让自己活得太累。应该学着想开、看淡，学着不强求，学着深藏。适时放松自己，寻找宣泄，给疲惫的心灵解解压。晚安！"
"愿所有的幸福都陪伴着你，仰首是春，俯首是秋；愿所有的欢乐都追随着你，月圆是诗，月缺是画！晚安baby！"
"寂静的夜，愿月亮为你祈祷，星星为你唱摇篮曲，清风为你催眠，床为你带来放松，枕头带你进入梦乡，我的祝福送你好梦，晚安！"
"水与水之间有距离，但地心下一直相牵，人与人之间有距离，但心里时刻挂念，发条短信道声晚安，梦里我们相见。"
"幸福很简单，就是每天过得平淡美好。每天花点时间，满足自己的饥渴。因为我们追求的是自己的幸福，而不是比别人幸福，晚安！"
"睡一睡，精神好，烦恼消，快乐长；睡一睡，心情好，做美梦，甜蜜蜜；睡一睡，身体健，头脑清，眼睛明。愿你酣然入梦，晚安！"
"静静的夜里手机响起，温馨的祝福传递给你，深深的思念围绕着你，洗去劳累洗去疲惫，道一声晚安说一句想你，愿你有个美妙梦境"
"梦想无论怎么模糊，它总潜伏在我们心底，使我们的心境永远得不到宁静，直到梦想成为事实。晚安！"
"夜深了，你睡没呢？愿皎皎明月，月光洒满窗前；繁星点点，伴你微笑入眠；轻轻祝福，送你一夜香甜。晚安！"
"好好睡觉，天天吃好。睡觉别起早，吃饭要吃饱。笑要说我好，做梦题别跑。早点睡觉就是好，说声晚安问声好，看！才子编的多好"
"大多数时光里，我们不是在重复自己的生活，就是在重复别人的生活。真正的幸福，不是活成别人那样，而是按自己的意愿去生活。晚安"
"遥寄相思与日月，点燃祝福心灯；快乐随风送真情，描绘幸福图腾；问候点点几多情，祝你幸福伴美梦！晚安！"
"月上柳梢鸟儿静悄，影随身动心清神静，此情此景祝福要到，愿你开心无烦无恼，好运随身幸福缠绕，晚安一声愿你笑笑。晚安！"
"有钱，用不到下辈子；貌美，不能当饭吃；幸福，就是两个人过日子。最美的日子，无非是我在闹，你在笑，如此足矣。晚安！"
"曾经拥有的不要忘记，已经得到的更加珍惜，属于自己的不要放弃，已经失去的留作回忆，生活若不如意，全看自己的选择。晚安！"
"太阳公公已经下班，月亮婆婆来到身边。不管外面的世界多么黑暗，家里的灯光是那么温暖；不管将来的前途是多么危险，我都将一心一意将你陪伴。快快进入梦乡，去寻找心中的最爱。愿你一切安好，美梦常在。晚安！"
)

face=(
"微笑"
"调皮"
"呲牙"
"调皮"
"偷笑"
"玫瑰"
"爱心"
"嘴唇"
"亲亲"
"飞吻"
"愉快"
)

NUM_MESSAGE=5
MAX_SEND_DELAY=120
for ((i = 0; i < $NUM_MESSAGE; i++)); do
    night_len=${#goodnight[@]}
    night_rnd=`expr $RANDOM % $night_len` 
    face_len=${#face[@]}
    face_rnd=`expr $RANDOM % $face_len` 
    message=${goodnight[$night_rnd]}"["${face[$face_rnd]}"]["${face[$face_rnd]}"]["${face[$face_rnd]}"]"
    #message="[微笑]"
    echo $message

    send_delay=`expr $RANDOM % $MAX_SEND_DELAY` 
    sleep $send_delay

    devid_rnd=`expr $RANDOM % 1000` 
    echo $devid_rnd

    curl 'https://wx.qq.com/cgi-bin/mmwebwx-bin/webwxsendmsg?sid=mC75iIJgu0KfRLij&skey=%40crypt_a1fe0bfd_b622bde60aa198f41fc11c6bf0127010&r=1428922925992&skey=%40crypt_a1fe0bfd_b622bde60aa198f41fc11c6bf0127010&pass_ticket=GIMZsI4CYiH%2Fwako4jsu%2F3ikgfbyjND4cy0EXNHWRJuDvS9e8cZIBzcFZ6p3o5xs' -H 'Cookie: luin=o0553069938; lskey=000100007a3b7656dd4df4f33f6f90463d398a4df93e71517a6b4479ec0b8177cdbbc1d8a54e74137c88795b; webwxuvid=c16d68cde205c5ecc25f1c388282f6268c2a8025b58a98d66881f2b20b9c14dca7d57d2887f75ee5749d4dae20d97b15; ptui_loginuin=553069938; ptcz=2e09c8cf0e3eb16e7871aea2dda84a7abe547f7d688e06a25891de1cd7be8af4; pgv_pvi=7035745280; RK=nU+m91mJd6; pgv_info=ssid=s429062909; pgv_pvid=547295088; o_cookie=553069938; ptisp=cnc; pt2gguin=o0553069938; uin=o0553069938; skey=@hpuNoTZSf; ptwebqq=2f4397126dee21b6fdf581d5c61085d258b833910b4021a7; pgv_si=s7060958208; mm_lang=zh_CN; wxstaytime=1428922904; wxloadtime=1428922904_expired; wxpluginkey=1428919349; wxuin=1340323841; wxsid=mC75iIJgu0KfRLij; webwx_data_ticket=AQavug6FCp2L0gyMfQ22fwzW' -H 'Origin: https://wx.qq.com' -H 'Accept-Encoding: gzip,deflate,sdch' -H 'Host: wx.qq.com' -H 'Accept-Language: zh-CN,zh;q=0.8' -H 'User-Agent: Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/29.0.1547.65 Chrome/29.0.1547.65 Safari/537.36' -H 'Content-Type: application/json; charset=UTF-8' -H 'Accept: application/json, text/javascript, */*; q=0.01' -H 'Referer: https://wx.qq.com/' -H 'X-Requested-With: XMLHttpRequest' -H 'Connection: keep-alive' --data-binary $'{"BaseRequest":{"Uin":1340323841,"Sid":"mC75iIJgu0KfRLij","Skey":"@crypt_a1fe0bfd_b622bde60aa198f41fc11c6bf0127010","DeviceID":"e188605904480'$devid_rnd'"},"Msg":{"FromUserName":"@3af26e9b63ec5a7f8466faaf8ac84919","ToUserName":"@b183292a5e0ef9cd9c36bcb2c0c57007","Type":1,"Content":"'$message'","ClientMsgId":1428922925991,"LocalID":1428922925991}}' --compressed
    curl 'https://wx.qq.com/cgi-bin/mmwebwx-bin/webwxsendmsg?sid=mC75iIJgu0KfRLij&skey=%40crypt_a1fe0bfd_b622bde60aa198f41fc11c6bf0127010&r=1428922976055&skey=%40crypt_a1fe0bfd_b622bde60aa198f41fc11c6bf0127010&pass_ticket=GIMZsI4CYiH%2Fwako4jsu%2F3ikgfbyjND4cy0EXNHWRJuDvS9e8cZIBzcFZ6p3o5xs' -H 'Cookie: luin=o0553069938; lskey=000100007a3b7656dd4df4f33f6f90463d398a4df93e71517a6b4479ec0b8177cdbbc1d8a54e74137c88795b; webwxuvid=c16d68cde205c5ecc25f1c388282f6268c2a8025b58a98d66881f2b20b9c14dca7d57d2887f75ee5749d4dae20d97b15; ptui_loginuin=553069938; ptcz=2e09c8cf0e3eb16e7871aea2dda84a7abe547f7d688e06a25891de1cd7be8af4; pgv_pvi=7035745280; RK=nU+m91mJd6; pgv_info=ssid=s429062909; pgv_pvid=547295088; o_cookie=553069938; ptisp=cnc; pt2gguin=o0553069938; uin=o0553069938; skey=@hpuNoTZSf; ptwebqq=2f4397126dee21b6fdf581d5c61085d258b833910b4021a7; pgv_si=s7060958208; mm_lang=zh_CN; wxstaytime=1428922904; wxloadtime=1428922904_expired; wxpluginkey=1428919349; wxuin=1340323841; wxsid=mC75iIJgu0KfRLij; webwx_data_ticket=AQavug6FCp2L0gyMfQ22fwzW' -H 'Origin: https://wx.qq.com' -H 'Accept-Encoding: gzip,deflate,sdch' -H 'Host: wx.qq.com' -H 'Accept-Language: zh-CN,zh;q=0.8' -H 'User-Agent: Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/29.0.1547.65 Chrome/29.0.1547.65 Safari/537.36' -H 'Content-Type: application/json; charset=UTF-8' -H 'Accept: application/json, text/javascript, */*; q=0.01' -H 'Referer: https://wx.qq.com/' -H 'X-Requested-With: XMLHttpRequest' -H 'Connection: keep-alive' --data-binary $'{"BaseRequest":{"Uin":1340323841,"Sid":"mC75iIJgu0KfRLij","Skey":"@crypt_a1fe0bfd_b622bde60aa198f41fc11c6bf0127010","DeviceID":"e188605904480'$devid_rnd'"},"Msg":{"FromUserName":"@3af26e9b63ec5a7f8466faaf8ac84919","ToUserName":"@d9cf0f726047dd4c6d243b315fe87e2df8acece99358ab6fdcf32444a17e3b4c","Type":1,"Content":"'$message'","ClientMsgId":1428922976055,"LocalID":1428922976055}}' --compressed
done
